"""
Функция получает на вход строку из двух чисел через пробел.
Сформируйте словарь, где ключом будет символ из Unicode, 
а значением - целое число.
Диапазон пар ключ-значение от наименьшего из введенных 
пользователем чисел до наибольшего включительно.
"""


def unicode_range(text: str) -> dict:
    """
    Возвращает словарь символов.

    Формирует словарь, где ключом будет символ из Unicode, 
    а значением - целое число.
    Диапазон пар ключ-значение от наименьшего из введенных 
    пользователем чисел до наибольшего включительно.
    """
    a, b = [int(i) for i in text.split()]
    return {chr(i): i for i in range(a, b+1)}


if __name__ == '__main__':
    text = input('Введите два числа: ')
    print(unicode_range(text))
    # print(unicode_range(input('Введите два числа: ')))
